DataProcessors/ЗагрузитьКомментарииАдминистратора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузитьКомментарииАдминистратора</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Должник</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДоговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийАдмин</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/Контакт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>Контакт</Name>
			<BasedOn>
				<xr:Item>Document.Планирование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Контакты</xr:Item>
				<xr:Item>InformationRegister.ПланированиеКонтактов</xr:Item>
				<xr:Item>InformationRegister.СтатусыДолжников</xr:Item>
				<xr:Item>AccumulationRegister.КонтактыДокументы</xr:Item>
				<xr:Item>InformationRegister.ПривязкаОтветственный</xr:Item>
				<xr:Item>AccumulationRegister.ПланВыездов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНеплатежа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныНеплатежа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Планирование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Планирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоВыезда</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СделатьСтатусОсновным</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсуществитьВыезд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийАдминистратора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийСотрудника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатБП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Телефон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Телефоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗвонка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Статусы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Адреса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатКонтакта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыКонтактов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Должники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Должники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDДолжника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаспортКогдаВыдан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Новый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегионаФССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СудебныйСтатус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеСтатусы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСудСтатус</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ЗагрузитьКомментарииАдминистратора/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбФайла.Заголовок				= "Выберите файл для загрузки:";
	ДиалогВыбФайла.ПолноеИмяФайла			= Объект.ИмяФайла; //АДРЕС
	ДиалогВыбФайла.Фильтр					= "Excel (*.xlsx)|*.xls*";
	ДиалогВыбФайла.Расширение				= "xlsx";
	ДиалогВыбФайла.МножественныйВыбор		= Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	= Ложь;
	ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ПослеВыбораФайла", ЭтаФорма));
	

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеВыбораФайла(ВыбранныеФайлы, ДопПарметры) Экспорт
	Если ЗначениеЗаполнено(ВыбранныеФайлы) и ВыбранныеФайлы.Количество() > 0 Тогда
		 Объект.ИмяФайла = ВыбранныеФайлы[0];
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФайл(Команда)
	// Вставить содержимое обработчика
	
	// Запишу файл строку 
	// 1  Имя файла
   //  2   - Должник (в шаблоне)
   //  3   - Номер договора (в шаблоне)
   //  4   - Комментарий (в шаблоне)
   
   
     должникЗаг="";
	 
	 // найдем должника
     стрДолж= ДолжникКолонка(Объект.ИмяШаблона);
	 стрДогДолж= ДоговорКолонка(Объект.ИмяШаблона);
	 стрКомменДолж= ДокКонтактКолонка(Объект.ИмяШаблона);

	 
	 загодин=Ложь;
	 
	  фамилия= стрДолж["Фамилия"];
	  имя=стрДолж["Имя"];
	  отчество=стрДолж["Отчество"];
	  
	  Если фамилия=имя Тогда
		  //Значит  один заголовок для Должника
		  должникЗаг=фамилия;
		  загодин=Истина;
	  Иначе
		  //пока вернемся
		    Возврат;
		  
	  КонецЕсли;	  

	  
	  
	  номердоговора=стрДогДолж["НомерДоговора"];
	  комментдолж=стрКомменДолж["КомментарийАдминистратора"];
	  
	  
	  
	  // запишу врем файл и передам его  обработчику

	     Shell = Новый COMОбъект("WScript.Shell");
         дирМоиД=Shell.SpecialFolders.Item("MyDocuments");

	   
	     имяэксел=Объект.ИмяФайла;
		 
		 
	   
	   
	   Если х2=Истина Тогда
	   
		 
		   
		 прогрпуть="D:\public\Distr";
		 
		 имяфайлатемп=прогрпуть+"\комментарадмин.txt";

		  	  
  	  ФайлТемп = Новый ЗаписьТекста(имяфайлатемп);
	  
	  ФайлТемп.ЗаписатьСтроку(должникЗаг);
      ФайлТемп.ЗаписатьСтроку(номердоговора);
	  
	  
	  ФайлТемп.ЗаписатьСтроку(комментдолж);
	  
	  
	  ФайлТемп.ЗаписатьСтроку(Объект.ИмяФайла);
	  
      ФайлТемп.Закрыть();

		 
		 
		 программаОбр=прогрпуть+"\ParseExcel86.exe";
		 
         имяфайлатемпответ=прогрпуть+"\комментарадмин_out.txt";
  		 
		 
	   Иначе
		   
		  имяфайлатемп=дирМоиД+"\комментарадмин.txt";
		  
		    	  
  	  ФайлТемп = Новый ЗаписьТекста(имяфайлатемп);
	  
	  ФайлТемп.ЗаписатьСтроку(должникЗаг);
      ФайлТемп.ЗаписатьСтроку(номердоговора);
	  
	  
	  ФайлТемп.ЗаписатьСтроку(комментдолж);
	  
	  
	  ФайлТемп.ЗаписатьСтроку(Объект.ИмяФайла);
	  
      ФайлТемп.Закрыть();

		  
		   
		  программаОбр=дирМоиД+"\ExcelParse.exe";

		  имяфайлатемпответ=дирМоиД+"\комментарадмин_out.txt";

	      
	   КонецЕсли;
	   
	   
		//программаОбр=дирМоиД+"\ExcelParse.exe";
	   
	   
            
         программаОбр=программаОбр+" "+"6";
         Shell.Run(программаОбр,0,1);

	  
		   //имяфайлатемпответ=дирМоиД+"\комментарадмин_out.txt";
		
		 мСтрокФайла = Новый Массив();


	     ВыбранныйФайл = Новый Файл(имяфайлатемпответ);
	   Если ВыбранныйФайл.Существует() Тогда
		   
		   ПрочитанныйТекст = Новый ЧтениеТекста(имяфайлатемпответ, КодировкаТекста.UTF8);
					
		   Строка = ПрочитанныйТекст.ПрочитатьСтроку();
												//а не был ли файл пуст?
					Если Строка <> Неопределено Тогда
					     мСтрокФайла.Добавить(Строка);
					КонецЕсли;
					
					Пока Строка <> Неопределено Цикл
                       Строка = ПрочитанныйТекст.ПрочитатьСтроку();
					     Если Строка <> Неопределено Тогда
					          мСтрокФайла.Добавить(Строка);
					     КонецЕсли;
					КонецЦикла;

		   
		   
	   КонецЕсли;	   
	  
		 
	          Для каждого стрд  Из мСтрокФайла Цикл
                   
				  Если стрд<>"" Тогда
				        должДанныет=РазбитьСтроку(стрд);

				   Запись=Объект.ТЧ.Добавить();
   			       Запись.Должник=должДанныет.ФИО;
  			       Запись.НомерДоговора=должДанныет.НомерДоговора;
				   
			       Запись.КомментарийАдмин=должДанныет.Комментарий;

				  	
				  
				  КонецЕсли;
				  
				  				  
			   КонецЦикла;	  
	  
	
	
КонецПроцедуры


&НаКлиенте
Функция РазбитьСтроку(стрк)

	  должДанные=Новый Структура;
	  
	 Разделитель = Символ(240);
     Строки = СтрЗаменить(стрк, Разделитель, Символы.ПС);
	 
	 Для Индекс = 1 По СтрЧислоСтрок(Строки) Цикл
		 
		 Если Индекс = 1 Тогда
		 
		 	 должДанные.Вставить("ФИО",СтрПолучитьСтроку(Строки, Индекс));
		 
		 КонецЕсли;
		 
		 
		 Если Индекс = 2 Тогда
		 
		 	 должДанные.Вставить("НомерДоговора",СтрПолучитьСтроку(Строки, Индекс));
		 
		 КонецЕсли;
		 
		 
		 Если Индекс = 3 Тогда
		 
		 	 должДанные.Вставить("Комментарий",СтрПолучитьСтроку(Строки, Индекс));
		 
		 КонецЕсли;
		 
		  
		
    КонецЦикла;

	  
	   Возврат   должДанные;

	
КонецФункции // ()



&НаСервере
Функция ДоговорКолонка(шаблонф)

	договорДолж=Новый Структура;
	  
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныФайловДоговоры.Реквизит КАК Реквизит,
		|	ШаблоныФайловДоговоры.Заголовки КАК Заголовки
		|ИЗ
		|	Справочник.ШаблоныФайлов.Договоры КАК ШаблоныФайловДоговоры
		|ГДЕ
		|	ШаблоныФайловДоговоры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", шаблонф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		договорДолж.Вставить(ВыборкаДетальныеЗаписи.Реквизит,ВыборкаДетальныеЗаписи.Заголовки);
		
	КонецЦикла;
	  
	  
	 Возврат договорДолж; 
	  

КонецФункции // ()

&НаСервере
Функция ДокКонтактКолонка(шаблонф)

	    контактДолж=Новый Структура;
	
		   	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныФайловДокументКонтакт.Реквизит КАК Реквизит,
		|	ШаблоныФайловДокументКонтакт.Заголовки КАК Заголовки
		|ИЗ
		|	Справочник.ШаблоныФайлов.ДокументКонтакт КАК ШаблоныФайловДокументКонтакт
		|ГДЕ
		|	ШаблоныФайловДокументКонтакт.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", шаблонф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		   контактДолж.Вставить(ВыборкаДетальныеЗаписи.Реквизит,ВыборкаДетальныеЗаписи.Заголовки);

	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат контактДолж;	

КонецФункции // ()


&НаСервере
Функция ДолжникКолонка(шаблонф)

	
	//    Получить должника Колонку
	
	должФИО=Новый Структура;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныФайловДолжники.Реквизит КАК Реквизит,
		|	ШаблоныФайловДолжники.Заголовки КАК Заголовки
		|ИЗ
		|	Справочник.ШаблоныФайлов.Должники КАК ШаблоныФайловДолжники
		|ГДЕ
		|	ШаблоныФайловДолжники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", шаблонф);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	    должФИО.Вставить(ВыборкаДетальныеЗаписи.Реквизит,ВыборкаДетальныеЗаписи.Заголовки);
	 
		
	КонецЦикла;

	
	Возврат должФИО;
	  
	

КонецФункции // ()


&НаКлиенте
Процедура ЗаписатьВБазу(Команда)
	// Вставить содержимое обработчика.
	
	массив=Новый Массив();  
	
	
	
	 Для каждого стр  Из Объект.ТЧ Цикл

		     ЗаписатьКомментарий(стр.Должник,стр.НомерДоговора,стр.КомментарийАдмин);

		 
		 
     КонецЦикла;

	
	
	
	Сообщить("Загружено");
	
КонецПроцедуры


&НаСервере
Функция ЗаписатьКомментарий(долж,номдог,комм)

	
	должникСсылка=Неопределено;
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Должники.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Договоры КАК Договоры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Должники КАК Должники
		|		ПО Договоры.Владелец = Должники.Ссылка
		|ГДЕ
		|	Договоры.НомерДоговора = &НомерДоговора
		|	И Должники.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", долж);
	Запрос.УстановитьПараметр("НомерДоговора", номдог);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		должникСсылка=ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	  	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Контакт.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Контакт КАК Контакт
		|ГДЕ
		|	Контакт.Должник = &Должник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Контакт.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Должник", должникСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		ссылкаДок=ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	
	 Если ссылкаДок<>Неопределено Тогда
	 
	 	       ТекущийОбъект = ссылкаДок.ПолучитьОбъект();	

	  
	           ТекущийОбъект.КомментарийАдминистратора=комм;
	  
	          ТекущийОбъект.Записать();
	

	 
	 КонецЕсли;
	 
	  	
	
	
	

КонецФункции // ()
